workspace/Catalogs/АукКонтактныеЛицаУчастниковАукционов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>АукКонтактныеЛицаУчастниковАукционов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.АукУчастникиАукционов</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КаналыВзаимодействия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КаналВзаимодействия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АукКаналыВзаимодействия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Текущий</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НастройкиКаналовВзаимодействия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НПП</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КаналВзаимодействия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АукКаналыВзаимодействия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭлементНастройки</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.АукЭлементыНастроекКаналовВзаимодействия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеНастройки</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.АукЭлементыНастроекКаналовВзаимодействия</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

workspace/Catalogs/АукКонтактныеЛицаУчастниковАукционов/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Функция ТекущиеКонтактныеДанныеКонтактныхЛиц(пМасКонтактныеЛица) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АукКонтактныеЛицаУчастниковАукционов.Ссылка КАК КонтактноеЛицо,
	|	АукКонтактныеЛицаУчастниковАукционов.Владелец КАК Участник,
	|	КонтактныеЛицаУчастниковКаналыВзаимодействия.КаналВзаимодействия КАК КаналВзаимодействия,
	|	КонтактныеЛицаУчастниковНастройкиКаналовВзаимодействия.НПП КАК НПП,
	|	КонтактныеЛицаУчастниковНастройкиКаналовВзаимодействия.ЭлементНастройки КАК ЭлементНастройки,
	|	КонтактныеЛицаУчастниковНастройкиКаналовВзаимодействия.ЗначениеНастройки КАК ЗначениеНастройки,
	|	АукЭлементыНастроекКаналовВзаимодействия.ТехническоеНаименование КАК ТехническоеНаименование
	|ИЗ
	|	Справочник.АукКонтактныеЛицаУчастниковАукционов КАК АукКонтактныеЛицаУчастниковАукционов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.АукКонтактныеЛицаУчастниковАукционов.КаналыВзаимодействия КАК КонтактныеЛицаУчастниковКаналыВзаимодействия
	|		ПО АукКонтактныеЛицаУчастниковАукционов.Ссылка = КонтактныеЛицаУчастниковКаналыВзаимодействия.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.АукКонтактныеЛицаУчастниковАукционов.НастройкиКаналовВзаимодействия КАК КонтактныеЛицаУчастниковНастройкиКаналовВзаимодействия
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.АукЭлементыНастроекКаналовВзаимодействия КАК АукЭлементыНастроекКаналовВзаимодействия
	|			ПО КонтактныеЛицаУчастниковНастройкиКаналовВзаимодействия.ЭлементНастройки = АукЭлементыНастроекКаналовВзаимодействия.Ссылка
	|		ПО (КонтактныеЛицаУчастниковКаналыВзаимодействия.КаналВзаимодействия = КонтактныеЛицаУчастниковНастройкиКаналовВзаимодействия.КаналВзаимодействия)
	|			И (КонтактныеЛицаУчастниковКаналыВзаимодействия.Ссылка = КонтактныеЛицаУчастниковНастройкиКаналовВзаимодействия.Ссылка)
	|ГДЕ
	|	АукКонтактныеЛицаУчастниковАукционов.Ссылка В(&КонтактныеЛица)
	|	И КонтактныеЛицаУчастниковКаналыВзаимодействия.Текущий
	|ИТОГИ ПО
	|	КонтактноеЛицо,
	|	КаналВзаимодействия,
	|	НПП";
	
	Запрос.УстановитьПараметр("КонтактныеЛица", пМасКонтактныеЛица);
	
	Возврат СформироватьКоллекциюНстроекКаналовСвязиВРазрезеУчастникаИЕгоКонтактногоЛица(Запрос); 
	
КонецФункции

Функция ДанныеКонтактногоЛица(пКонтактноеЛицо) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АукКонтактныеЛицаУчастниковАукционов.Фамилия КАК Фамилия,
	|	АукКонтактныеЛицаУчастниковАукционов.Имя КАК Имя,
	|	АукКонтактныеЛицаУчастниковАукционов.Отчество КАК Отчество,
	|	АукКонтактныеЛицаУчастниковАукционов.Должность КАК Должность
	|ИЗ
	|	Справочник.АукКонтактныеЛицаУчастниковАукционов КАК АукКонтактныеЛицаУчастниковАукционов
	|ГДЕ
	|	АукКонтактныеЛицаУчастниковАукционов.Ссылка = &КонтактноеЛицо";
	
	Запрос.УстановитьПараметр("КонтактноеЛицо", пКонтактноеЛицо);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат ЭдоОбщийСервер.РезультатЗапросаВСтруктуру(РезультатЗапроса);
КонецФункции

Функция ФамилияИмяОтчествоКонтактногоЛица(пКонтактноеЛицо) Экспорт
	сткДанныеКонтЛица = ДанныеКонтактногоЛица(пКонтактноеЛицо);
	
	масСтрока = Новый Массив;
	
	масСтрока.Добавить(сткДанныеКонтЛица.Фамилия);
	масСтрока.Добавить(сткДанныеКонтЛица.Имя);
	
	Если ЗначениеЗаполнено(сткДанныеКонтЛица.Отчество) Тогда
		масСтрока.Добавить(сткДанныеКонтЛица.Отчество);
	КонецЕсли;
	
	Возврат СтрСоединить(масСтрока, " "); 
КонецФункции

Функция ФамилияИИнициалыКонтактногоЛица(пКонтактноеЛицо) Экспорт
	сткДанныеКонтЛица = ДанныеКонтактногоЛица(пКонтактноеЛицо);
	
	стрРезультат = сткДанныеКонтЛица.Фамилия;
	
	стрРезультат = стрРезультат + " " + СтрШаблон("%1.", Лев(сткДанныеКонтЛица.Имя, 1));
	
	Если ЗначениеЗаполнено(сткДанныеКонтЛица.Отчество) Тогда
		стрРезультат = стрРезультат + " " + СтрШаблон("%1.", Лев(сткДанныеКонтЛица.Отчество, 1));
	КонецЕсли;
	
	Возврат стрРезультат; 
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СформироватьКоллекциюНстроекКаналовСвязиВРазрезеУчастникаИЕгоКонтактногоЛица(пЗапрос) 
	
	сооРезультат = Новый Соответствие;
	
	ВыборкаКонтактныеЛица = пЗапрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаКонтактныеЛица.Следующий() Цикл
		
		сткРезультат = Новый Структура("КонтактноеЛицо, Участник, КаналВзаимодействия, НастройкиКаналаВзаимодействия",,,, Новый Массив);
		
		ЗаполнитьЗначенияСвойств(сткРезультат, ВыборкаКонтактныеЛица);
		
		ВыборкаКаналВзаимодействия = ВыборкаКонтактныеЛица.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
		Пока ВыборкаКаналВзаимодействия.Следующий() Цикл
			
			сткРезультат.КаналВзаимодействия = ВыборкаКаналВзаимодействия.КаналВзаимодействия;
			
			ВыборкаНПП = ВыборкаКаналВзаимодействия.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаНПП.Следующий() Цикл
				
				ВыборкаДетальная = ВыборкаНПП.Выбрать();
				
				сткНастройки = Новый Структура;
				
				Пока ВыборкаДетальная.Следующий() Цикл
					
					сткНастройки.Вставить(ВыборкаДетальная.ТехническоеНаименование, ВыборкаДетальная.ЗначениеНастройки);	
					
				КонецЦикла;
				
				сткРезультат.НастройкиКаналаВзаимодействия.Добавить(сткНастройки);
					
			КонецЦикла;
			
		КонецЦикла; 
		
		сооРезультат.Вставить(ВыборкаКонтактныеЛица.КонтактноеЛицо, сткРезультат);
		
	КонецЦикла;	
	
	Возврат сооРезультат;
	
КонецФункции	

#КонецОбласти
